[
  {
    "filename": "26402657-F7E5-439D-B9D2-DE62EF28E483.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\26402657-F7E5-439D-B9D2-DE62EF28E483.jpg",
    "description": "This high-quality landscape image shows a detailed, close-up view of a Mercedes-Benz diesel engine, likely an OM651 or OM654 commonly found in Sprinter vans, which has been completely removed from the vehicle. The engine is positioned on a red floor jack within a workshop setting, revealing mechanical components such as the flywheel, timing gear, and alternator, alongside various sensors and wiring harnesses. The lighting is bright and industrial, highlighting the gritty, professional nature of a major mechanical repair. No diagnostic computers or faces are visible, focusing entirely on the internal hardware of the powertrain resting on the concrete workshop floor.",
    "size_kb": 1178,
    "width": 2730,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "271DF588-656B-4934-ABF6-58D06CD62301.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\271DF588-656B-4934-ABF6-58D06CD62301.jpg",
    "description": "thoughtful\nThis high-quality portrait orientation image provides a detailed top-down view of a vehicle's engine bay with the valve cover removed, exposing the dual overhead camshafts and timing gears. The mechanical components appear clean and well-maintained, set against a professional workshop background with focused technical lighting that highlights the metallic textures. While no exterior vehicle markings, diagnostic laptops, or people are visible, the complex arrangement of wiring harnesses and fluid lines is consistent with a modern diesel engine like those found in a Mercedes Sprinter. The mood is industrial and precise, emphasizing the technical nature of major mechanical diagnostics and repair.",
    "size_kb": 1163,
    "width": 1536,
    "height": 2730,
    "orientation": "portrait"
  },
  {
    "filename": "5661ca25-b449-43b1-aa1a-c0ce09a15184.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\5661ca25-b449-43b1-aa1a-c0ce09a15184.jpg",
    "description": "This high-quality portrait orientation image captures a close-up, top-down view of the engine bay of a white Mercedes-Benz Sprinter van. A mechanic's hands are visible working deep within the engine components, illuminated by a bright, focused inspection light that creates a moody, professional atmosphere and highlights wisps of smoke or vapor. Visible tools include a red Milwaukee cordless impact driver resting near the cowl and a red booster cable clamp attached to the lower engine area, though no diagnostic screens are present. The setting appears to be a workshop or indoor service area, focusing on mechanical investigation rather than software interface, and no faces are visible.",
    "size_kb": 252,
    "width": 1200,
    "height": 1600,
    "orientation": "portrait"
  },
  {
    "filename": "aa5e9f84-b161-4913-bc8a-cfd06c65a6b5.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\aa5e9f84-b161-4913-bc8a-cfd06c65a6b5.jpg",
    "description": "This close-up portrait image shows a Mercedes-Benz electronic control unit (ECU) or module, labeled as \"Mercedes-Benz IC5\" by Visteon, which is typically found within the interior or dashboard assembly of a vehicle. The component features a prominent technical sticker displaying part numbers such as A 420 900 33 05 and A 907 901 40 03, indicating it is compatible with modern Mercedes Sprinter (907) models. Surrounding the finned metal housing are various wiring harnesses and connectors, captured in clear, bright workshop lighting that highlights the factual details of the hardware. No people, diagnostic screens, or full vehicle exteriors are visible, focusing instead on the specific hardware required for professional Xentry diagnosis and programming.",
    "size_kb": 520,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "e352c610-566f-4ffc-b9ac-7258ef5d0cd7.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\e352c610-566f-4ffc-b9ac-7258ef5d0cd7.jpg",
    "description": "This high-quality, portrait-orientation image provides a close-up view of a Mercedes Sprinter engine bay, focusing on damaged electrical components. A technician wearing a tan work glove is holding a wiring loom that has been badly frayed or chewed, exposing blue and copper wires near the air intake ducting. The lighting is bright and natural, creating a professional and diagnostic mood that highlights a clear mechanical fault. No faces or diagnostic screens are visible; the focus remains entirely on the physical inspection of the damaged engine harness.",
    "size_kb": 382,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "EC6F9242-489F-4D13-9D63-7689C3CE1EF3.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\EC6F9242-489F-4D13-9D63-7689C3CE1EF3.jpg",
    "description": "This portrait-oriented image shows a detailed view of a Mercedes Sprinter van interior that has been completely stripped back to the firewall and dashboard frame within a professional workshop setting. Visible components include a complex exposed wiring loom, an ECU/control module, and a towing eye bolt stored in a plastic compartment, with the van's hood and a roller-shutter door visible in the background. The lighting is bright and industrial, highlighting the technical nature of deep electrical diagnostics or repair without any people or faces visible. Although the full vehicle is not shown, the distinctive hood vents and interior architecture identify it as a silver or grey Sprinter model undergoing significant maintenance or electronic troubleshooting.",
    "size_kb": 994,
    "width": 1536,
    "height": 2730,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0017.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0017.jpg",
    "description": "This portrait-oriented image shows a close-up, high-quality view of a technician's oil-stained hand holding a damaged multi-pin electrical connector, likely from a Mercedes Sprinter’s engine bay or chassis. Various colored wires (green, yellow, brown) are visible entering the white plastic plug, notably featuring one frayed and exposed copper wire that has broken away from the harness. The setting is a workshop environment with a concrete floor and tools visible in the blurred background, creating a professional, \"in-the-trenches\" diagnostic mood. While no vehicle exterior or Xentry equipment is shown, the image clearly documents a specific electrical fault being investigated during a mobile diagnostic service. No faces are visible in the frame.",
    "size_kb": 340,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0018.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0018.jpg",
    "description": "This close-up portrait orientation image shows a damaged wiring harness with several frayed and severed electrical wires, including brown, white, and green-and-yellow strands, protruding from black fabric protective looming. The setting is likely the interior or chassis of a Mercedes Sprinter, showing a dusty workshop-style environment with no people visible. While no specific diagnostic equipment is present, the image highlights a clear electrical fault that would require professional repair or Xentry software to clear subsequent error codes. The lighting is direct and clear, focusing on the technical damage of the vehicle's electrical system with high detail.",
    "size_kb": 703,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0021.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0021.jpg",
    "description": "This portrait-oriented, high-quality photograph shows a close-up view of a vehicle's undercarriage and engine components in a professional garage setting. The central focus is a silver cast-metal engine oil pan or transmission housing that shows significant horizontal abrasive wear or \"scuffing\" along its bottom edge, surrounded by black hoses and frame components. While the specific vehicle model is not visible, the setting and industrial nature of the parts are consistent with a Mercedes Sprinter van inspection in a workshop environment. The lighting is bright and technical, highlighting the textures of the mechanical parts, and no people, diagnostic tools, or laptops are visible in the frame.",
    "size_kb": 606,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0058.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0058.jpg",
    "description": "This high-quality, portrait-orientation image shows a close-up of a technician's oil-stained hand holding a circular vacuum or pressure gauge over a vehicle's engine bay. The gauge features a needle pointing deep into a green \"negative\" zone (near -10 to -20 range) and is marked with percentages from 0 to -100. In the blurred background, components of a Mercedes-Benz engine bay are visible, including hoses, a fuel injector area, and various mechanical parts, suggesting a workshop setting. The lighting is bright and industrial, creating a professional and practical mood for mechanical troubleshooting. No faces are visible, focusing the viewer's attention entirely on the diagnostic tool and the engine inspection process.",
    "size_kb": 334,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0075.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0075.jpg",
    "description": "This portrait-oriented, high-quality photograph shows a close-up of a damaged side-view wing mirror on a white Mercedes-Benz Sprinter van. The black plastic mirror housing is heavily scuffed, and the integrated indicator lens is shattered, exposing the amber light bulb and chrome reflector. No diagnostic tools, digital screens, or people are visible in the shot, which focuses strictly on the van's exterior damage in a brightly lit professional setting. Partial fleet branding for \"A Wolseley Group Company\" is visible on the door below the mirror, suggesting a commercial work vehicle.",
    "size_kb": 419,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0076.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0076.jpg",
    "description": "This portrait-oriented image shows a close-up, internal view of a vehicle component, likely located within the door or mirror assembly of a Mercedes Sprinter. The central focus is a circular plastic mounting bracket or motor housing that appears heavily damaged and coated in a gritty, yellowish residue or dried paste. Several thin electrical wires in various colors (blue, white, red, and green) are visible, connected to a small black plug and routed around the dark plastic framework. The lighting is somewhat dim with a technical and gritty mood, highlighting the mechanical failure without any people or specific diagnostic tools present. The overall quality is clear and functional, appearing to be taken in a workshop or at a service site to document a required repair.",
    "size_kb": 393,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0082.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0082.jpg",
    "description": "This high-angle, portrait-orientation photograph shows a close-up view of a dual-piston brake caliper assembly, likely from a heavy-duty vehicle like a Mercedes Sprinter. The image highlights significant mechanical wear and damage, specifically showing a torn and perished rubber dust boot on one of the pistons and visible rust within the piston bores. The setting is a workshop environment with bright, overhead lighting that clearly captures the grit, grime, and grease coating the metal components; no people, diagnostic electronics, or vehicle exteriors are visible. The photo serves as a professional record of a mechanical failure that would require physical repair alongside any Star Diagnosis software resets.",
    "size_kb": 379,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0084.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0084.jpg",
    "description": "This high-quality, portrait-orientation photograph shows a close-up, internal view of a vehicle's exhaust tailpipe, which is heavily coated in matte black soot and carbon deposits. No specific vehicle make, external bodywork, or diagnostic tools are visible, though the image focuses on a common area of inspection for DPF and emissions-related diagnostics. The lighting is direct but natural, creating a clinical and documentary mood that highlights the buildup inside the metal pipe. No people or workshop backgrounds are visible, as the shot is tightly framed on the mechanical component.",
    "size_kb": 339,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0129.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0129.jpg",
    "description": "This portrait-oriented image shows a close-up, under-chassis view of a vehicle, highlighting the driveshaft, exhaust system, and fuel tank. The driveshaft features a distinctive dark wear mark or residue ring, and a thin metal cable is visible running parallel to it. No diagnostic tools, digital screens, or people are visible, as the shot focuses purely on the mechanical components. The lighting is bright and clinical, likely from a workshop torch, providing a clear and professional view of the underside for inspection purposes. While no branding is visible, the component layout is consistent with the underside of a large commercial van like a Mercedes Sprinter.",
    "size_kb": 423,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0141.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0141.jpg",
    "description": "This portrait-oriented image shows a professional workshop setting where a technician’s gloved hands are using a specialized Mercedes-Benz branded vernier caliper (part number W 140 589 00 19 00) to measure the thickness of a worn brake disc. Overlay text indicates the measurement is for the \"OSR DISK\" at 15.6mm, noting it is near the \"Wear limit (15mm).\" The lighting is bright and focused on the tool, creating a clinical and professional mood that emphasizes mechanical precision. No vehicles, people’s faces, or digital diagnostic equipment are visible, as the shot focuses strictly on the physical brake component and the measuring tool.",
    "size_kb": 423,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0146.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0146.jpg",
    "description": "This high-quality portrait orientation image shows a close-up of a rusted, cylindrical metal component, likely a seized slide pin or mechanical fastener, held in a person's palm. The individual is wearing a black nitrile glove and a dark grey work jacket, though no faces or identifying features are visible. The setting appears to be a brightly lit workshop or outdoor service area with a blurred concrete floor and a roller shutter door in the background. While no vehicles or diagnostic screens are shown, the focus is squarely on the corroded hardware, highlighting the hands-on mechanical repair aspect of the service.",
    "size_kb": 351,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0191.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0191.jpg",
    "description": "This high-quality portrait orientation image shows a close-up of a person's hand holding a grey electronic fuel system component, likely a fuel pressure regulator or sensor, within a vehicle's engine bay. The component features clear Mercedes-Benz branding, part numbers, and QR codes, positioned against a backdrop of complex engine parts and wiring. The lighting is bright and direct, highlighting the technical details of the part in a professional diagnostic setting, though no diagnostic screens or tools are visible. No faces are shown, focusing exclusively on the mechanical repair work being performed on the vehicle.",
    "size_kb": 563,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0243.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0243.jpg",
    "description": "This high-quality, portrait-orientation image provides a close-up overhead view of a Mercedes-Benz diesel engine bay, focusing on a fuel injector and its associated wiring harness. The component displays a clear Mercedes-Benz logo and serial numbers (part A6510703087), identifying it as part of an OM651 engine commonly found in Sprinter vans. The lighting is direct and bright, highlighting the dusty condition of the engine components and the multicolor electrical connector wires (yellow, red, blue, and white). The shot focuses purely on the mechanical hardware for diagnostic inspection; no people, diagnostic screens, or external tools are visible in this professional, technical capture.",
    "size_kb": 810,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0244.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0244.jpg",
    "description": "This high-quality, portrait-orientation image provides a close-up, top-down view into a vehicle's engine bay, specifically highlighting a disconnected intake or sensor pipe. The component in the center of the frame is coated in a thick, dark, oily residue, suggesting a potential leak or carbon buildup issue typical for engine diagnostics. The lighting is bright and direct, likely from a mechanic's torch, creating a professional and clinical mood for technical inspection. While no diagnostic laptops or people's faces are visible, a gloved finger is partially seen at the top right, indicating a hands-on mechanical assessment. No specific vehicle make or model can be definitively identified from this macro perspective, though the components are consistent with a modern diesel engine setup.",
    "size_kb": 564,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0245.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0245.jpg",
    "description": "This detailed portrait-oriented close-up shows a heavily damaged engine air filter, featuring a warped and torn orange rubber seal and pleated filter media, resting against its black plastic housing components. The image highlights a specific mechanical failure likely found in a Mercedes Sprinter engine bay, focusing on the tool/part itself rather than the vehicle exterior or a diagnostic screen. The lighting is bright and even, creating a professional and clinical mood suitable for demonstrating a maintenance issue to a client. No people, faces, or electronic diagnostic equipment are visible in this high-quality, focused shot.",
    "size_kb": 729,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0303.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0303.jpg",
    "description": "This portrait-oriented image shows a close-up, internal view of a damaged turbocharger unit, likely removed from a Mercedes-Benz vehicle given the visible \"654\" part number prefix on the casting. The shot looks directly into the turbine housing, revealing catastrophic mechanical failure with sheared and mangled metal shards visible deep inside the component. The lighting is bright and clinical, highlighting the contrast between the clean exterior aluminum housing and the dark, damaged core. No vehicles, diagnostic screens, or people are visible, as the focus is solely on this specific engine component within a workshop or inspection setting. The image is of high quality and serves as a professional photographic record of a significant mechanical fault.",
    "size_kb": 434,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0325.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0325.jpg",
    "description": "This high-resolution landscape photograph provides a detailed top-down view into the engine bay of a white vehicle, consistent with the Mercedes-Benz Sprinter engine layout. The engine components are covered in white soapy foam, suggesting a leak detection process or a deep cleaning service is underway. The lighting is bright and industrial, creating a professional and diagnostic atmosphere, though no external diagnostic equipment, laptops, or people are visible in the frame. The focus is entirely on the mechanical condition of the engine block, various hoses, and wiring looms, highlighting the technical nature of TriPoint Diagnostics' work.",
    "size_kb": 686,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0440.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0440.jpg",
    "description": "This high-quality, portrait-orientation image provides a top-down view of a dismantled 4-cylinder Mercedes-Benz engine block, likely from a Sprinter van, showcasing a new head gasket seated over the cylinder bores. The scene is set within a workshop environment, featuring professional-grade mechanical detail with various engine components, hoses, and a shop rag visible surrounding the engine assembly. The lighting is bright and even, creating a clean and professional mood that emphasizes the precision of the mechanical repair. No people, diagnostic screens, or specialized electronic equipment are present; the focus is entirely on the internal physical components of the engine bay during a major service.",
    "size_kb": 830,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0442.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0442.jpg",
    "description": "This portrait-oriented image shows a close-up of a handheld Stanley video borescope inspection tool being used in a dark, professional workshop setting. The device's illuminated screen displays a grainy, blue-tinted internal view of a mechanical component, likely inside a Mercedes Sprinter engine bay or chassis. No vehicles, people, or faces are visible, as the focus is entirely on the diagnostic tool and the internal view it provides. The lighting is very dark and moody, emphasizing the bright glow of the diagnostic screen against a black, textured background. The image is of high quality, capturing the specific texture of the yellow buttons and the rugged casing of the specialized equipment.",
    "size_kb": 286,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0443.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0443.jpg",
    "description": "This portrait-oriented image shows a close-up of a heavily fouled automotive component, specifically an Exhaust Gas Recirculation (EGR) pipe or sensor, thick with black carbon soot buildup. The component is resting against the exterior of a white van, likely a Mercedes Sprinter, near the windshield and wiper assembly in a bright, outdoor setting. No diagnostic tools, digital screens, or people are visible, as the focus is entirely on the physical evidence of the engine fault. The image is of high quality and serves as a professional, factual record of a common mechanical issue encountered during a vehicle inspection.",
    "size_kb": 376,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0444.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0444.jpg",
    "description": "This high-quality, portrait-orientation image provides a close-up view of a soot-covered oxygen (O2) sensor or NOx sensor probe removed from a Mercedes-Benz engine bay. The sensor is set against a background of engine components, including heat shielding and a plastic housing held by distinctive green-tinted Torx bolts, with visible Mercedes-Benz part numbers embossed on the plastic. The lighting is focused and professional, highlighting the dark carbon buildup on the sensor tip to illustrate a mechanical fault or maintenance requirement. No people, diagnostic screens, or vehicle exteriors are visible in this detailed technical shot.",
    "size_kb": 425,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0457.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0457.jpg",
    "description": "This high-quality, portrait-oriented photograph provides a detailed top-down view of an exposed engine bay, focusing on the cylinder head and valve train assembly. The image showcases the internal mechanical components of the engine, including the rocker arms and valve springs, while various hoses, heat shields, and engine accessories like the oil filter housing are visible in the background. While the specific vehicle model and color are not visible, the complex mechanical layout is consistent with a professional workshop environment. The lighting is bright and clear, emphasizing the clean, metallic surfaces of the engine parts to create a professional and technical mood. No people, diagnostic screens, or OBD cables are visible in this specific shot.",
    "size_kb": 755,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0489.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0489.jpg",
    "description": "This portrait-oriented image provides a detailed, high-quality look into the battery and fuse compartment of a vehicle, characteristic of a Mercedes Sprinter’s interior power distribution center. The shot features a complex arrangement of heavy-duty black plastic fuse housings, thick red and black power cables, and various electrical connectors and terminals. A metal socket tool is resting on one of the terminal posts, indicating active maintenance or diagnostic work being performed. The lighting is bright and focused, using a professional work light to create a clear, technical mood within the dark, recessed workspace. No people are visible, keeping the focus entirely on the intricate electrical components and the tools required for TriPoint Diagnostics' specialized services.",
    "size_kb": 567,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0499.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0499.jpg",
    "description": "This landscape-oriented, high-quality photograph shows a close-up of a Mercedes-Benz infotainment screen, specifically the MBUX system typical of a modern Sprinter van. A diagnostic alert message is displayed reading, \"Your vehicle has detected a breakdown,\" offering the driver options to call for assistance. Below the screen, physical buttons for navigation, radio, and volume are visible, along with a yellow identification sticker featuring the registration \"OW19 ZHG.\" The lighting is dim and focused on the screen, creating a professional but urgent tone suitable for highlighting a vehicle fault. No people, workshop tools, or exterior vehicle parts are visible in this interior shot.",
    "size_kb": 381,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0500.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0500.jpg",
    "description": "This landscape-oriented photograph shows a close-up of a Mercedes-Benz Sprinter instrument cluster, likely from a second-generation (NCV3) model, displaying numerous active warning lights. The central digital display shows a \"Reserve fuel level\" message alongside a litany of amber and red fault indicators, including the check engine light, ABS, ESP, battery, and brake system warnings. The shot is taken from the driver's perspective in a low-light setting, creating a professional but moody atmosphere that highlights the vehicle's electrical or mechanical issues. This high-quality image focuses entirely on the van's interior dashboard with no people, diagnostic tools, or external environment visible.",
    "size_kb": 483,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0506.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0506.jpg",
    "description": "This high-quality portrait orientation image provides an extreme close-up of internal electronic vehicle components, likely located within the engine bay or undercarriage of a Mercedes Sprinter. Visible hardware includes a \"Continental\" branded control module, various electrical connectors with blue sealant markers, a small electric motor, and a green circuit board. The lighting is bright and technical, highlighting the intricate mechanical and electrical details against a blurred workshop background containing blue service equipment. No people or diagnostic screens are visible, but the focus on complex wiring and modules aligns with professional Star Diagnosis troubleshooting.",
    "size_kb": 422,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0508.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0508.jpg",
    "description": "This vertical orientation, high-quality macro photograph shows a close-up view of an internal vehicle component, specifically focusing on a black plastic sensor housing with electrical pins. The image highlights significant blue-ish corrosion on the silver metal pins and moisture droplets on the surrounding plastic, indicating water ingress or a leak within a technical area like an engine bay or fuse box. The lighting is bright and clinical, using a direct flash to provide a professional, diagnostic-style view of the damage without any people or external vehicle bodywork visible. This specific perspective is typical for documenting electrical failures and hardware faults during a Mercedes-Benz technical inspection.",
    "size_kb": 397,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0511.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0511.jpg",
    "description": "This high-quality, portrait-orientation image provides a close-up, internal view of a circular metal exhaust pipe or turbocharger intake tube, showing significant internal scoring and wear marks. The setting is likely a professional workshop, evidenced by the blurred background showing a vehicle lift and bright, clinical floor lighting. While no specific vehicle make or model is visible, the component shown is a critical part of a van's engine or exhaust system under diagnostic inspection. No people, diagnostic laptops, or OBD equipment are present in the frame, focusing entirely on the damaged mechanical component. The lighting is bright and industrial, highlighting the texture of the metal for a clear, factual assessment of part failure.",
    "size_kb": 327,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0535.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0535.jpg",
    "description": "This high-quality portrait image shows a close-up of a heavily carbon-clogged engine component, likely a MAP sensor or EGR-related part, held in front of a Mercedes-Benz Sprinter engine bay. The background reveals the blurred interior of the engine compartment with various mechanical components and fluids visible, though no specific diagnostic laptops or cables are shown. The lighting is bright and industrial, highlighting the thick, black soot buildup to demonstrate a common mechanical failure requiring professional diagnosis. No people or faces are visible in the shot, which focuses entirely on the mechanical issue within a workshop-style setting.",
    "size_kb": 389,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0565.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0565.jpg",
    "description": "This vertical, high-quality portrait image shows a close-up of a technician's hand in a black nitrile glove holding a disconnected electrical harness plug beneath a vehicle. The plug has a visible red weather seal and a Mercedes-Benz part number, which is being positioned next to a corresponding dirty, plastic-housed sensor or actuator located on the vehicle's chassis or engine bay. No diagnostic equipment is visible, but the bright, focused lighting creates a professional “in-the-field” atmosphere suitable for showing mechanical repair work. The background is blurred, focusing entirely on the technical detail of the components, and no faces are visible.",
    "size_kb": 587,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0568.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0568.jpg",
    "description": "This portrait-oriented image shows a close-up technical view of a vehicle engine bay, specifically focusing on an open, oily fill port or component housing. The plastic housing features a visible Mercedes-Benz logo and the part number \"A 654 159 29 01,\" identifying it as a component likely from an OM654 engine found in modern Mercedes Sprinter vans. The lighting is bright and clinical, using a harsh flash to highlight the dark, wet oil residue and grime within the mechanical part. No tools, screens, or people are visible, as the shot focuses entirely on documenting the internal condition of the engine component for diagnostic purposes.",
    "size_kb": 793,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0591.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0591.jpg",
    "description": "This high-quality portrait orientation image shows a close-up, top-down view of a mechanical component within an engine bay, likely the rear main seal area with the flywheel or torque converter removed. Significant oil leakage and staining are visible across the internal housing, suggesting a mechanical failure that requires diagnostic attention. No specific vehicle make is identifiable, but the complex arrangement of bolts and metallic surfaces is consistent with professional engine repair in a workshop setting. The lighting is bright and focused on the center of the component, creating a clinical and diagnostic mood that highlights the mess of the leak. No people, faces, or handheld diagnostic tools are visible in this frame.",
    "size_kb": 570,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0646.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0646.jpg",
    "description": "This landscape-oriented, high-resolution photograph shows a detailed top-down view of a Mercedes-Benz fuse box and relay panel, likely located under the dashboard or seat of a Sprinter van. The image features several Mercedes-branded relays and a multi-colored array of blade fuses organized into blue, yellow, and green banks. In the foreground, a brown padded mailing envelope with a shipping label addressed to a UK location is visible against a black diamond-plate floor mat. The lighting is bright and clear, creating a professional, documentary-style mood that highlights the electrical components for diagnostic purposes. No people, faces, or diagnostic screens are visible in this interior workshop-style shot.",
    "size_kb": 819,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0668.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0668.jpg",
    "description": "This high-quality, portrait-oriented image shows a top-down view of a vehicle's open rear differential housing, revealing the internal ring gear and carrier assembly. Set in a workshop environment, the mechanical components are surrounded by tools including a yellow DeWalt impact driver, sockets, and a green oil drain pan on a concrete floor. While the specific vehicle isn't fully visible, the heavy-duty nature of the axle assembly is consistent with a Mercedes Sprinter drivetrain undergoing mechanical repair. The lighting is bright and industrial, creating a professional \"work-in-progress\" mood without any people or diagnostic screens present.",
    "size_kb": 688,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0697.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0697.jpg",
    "description": "This high-quality, portrait-oriented image shows a UNI-T UT203 digital clamp multimeter measuring current on a thick black cable inside a vehicle. The diagnostic tool displays a reading of -00.19 DC, and it is positioned on a dusty door sill featuring \"Mercedes\" embossed in the plastic, confirming it is an interior shot of a Mercedes-Benz van. The lighting is bright and functional, highlighting the gritty, real-world workshop environment without any people or faces visible. This professional shot clearly demonstrates electrical troubleshooting or parasitic draw testing on a Sprinter's main wiring system.",
    "size_kb": 679,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0722.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0722.jpg",
    "description": "This portrait-orientation image shows a close-up of electrical diagnostic tools, specifically a UNI-T UT203 digital clamp multimeter and a handheld digital oscilloscope screen displaying a DC voltage reading of 13.650V. The equipment is resting on a textured, grey concrete workshop floor, with various red and black test leads connected to the devices. No vehicles or people are visible in this shot, focusing entirely on the technical measurement process. The lighting is bright and even, creating a clear, professional, and factual mood suitable for documenting a battery or alternator charging test. The image is of high quality and provides a detailed view of the tool interfaces and readings.",
    "size_kb": 565,
    "width": 1260,
    "height": 2736,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0727.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0727.jpg",
    "description": "This high-resolution landscape image shows a close-up, top-down view of a Garrett turbocharger assembly, likely removed from a vehicle and placed in a workshop setting. The focus is directed into the intake/exhaust housing, revealing internal components and significant soot buildup, with a visible Mercedes-Benz part number tag (starting with \"A 654\") in the upper right. The lighting is bright and industrial, clearly highlighting the metallic textures and the dark residue inside the component without any people or faces present. This technical shot specifically showcases engine bay hardware rather than diagnostic screens or the van exterior, emphasizing the mechanical nature of the repair.",
    "size_kb": 598,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0728.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0728.jpg",
    "description": "This landscape-oriented, high-quality photograph shows a removed intake manifold and a throttle body actuator resting on a textured concrete workshop floor. The metal components show significant black carbon buildup in the ports and heat discoloration on the manifold's surface, indicating a mechanical repair or diagnostic investigation into engine performance issues. While no vehicle or diagnostic software is visible, the parts are characteristic of a diesel engine system, such as those found in a Mercedes Sprinter. The lighting is bright and direct, likely from an overhead shop light or camera flash, creating a clinical and professional documentary mood. No people or faces are present in the frame.",
    "size_kb": 819,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0734.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0734.jpg",
    "description": "This landscape-oriented close-up shows the internal engine bay of a vehicle, specifically focusing on the intake manifold and fuel rail area, which appears heavily soiled with oil and carbon buildup. While the vehicle model isn't fully visible, the engine components are consistent with a Mercedes-Benz diesel powerplant often found in Sprinter vans. No diagnostic screens, cables, or people are present, and the lighting is bright yet harsh, likely from a camera flash or workshop lamp, creating a clinical and functional mood. The high-quality image provides a detailed view of mechanical components, making it suitable for documenting wear or leaks during a mechanical inspection.",
    "size_kb": 851,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0800.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0800.jpg",
    "description": "This high-quality portrait image shows a detailed view of an exposed engine bay, likely belonging to a Mercedes-Benz Sprinter, during a complex mechanical repair. A bright DeWalt cordless LED work light illuminates the intricate fuel injectors, wiring harnesses, and components, creating a professional and focused mood against the darker recesses of the engine compartment. While diagnostic screens are not visible, specialized repair equipment is present, including a tray of removed parts and a heat sink placed near the windshield cowl. No people or faces are visible in the frame, keeping the focus entirely on the technician's workspace and the technical state of the vehicle.",
    "size_kb": 777,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0817.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0817.jpg",
    "description": "This high-quality landscape image shows a brightly lit internal fuse box and relay panel, characteristic of a Mercedes-Benz Sprinter van interior. The panel features various colorful fuses and Hella-branded relays surrounded by taped wiring harnesses, with a clear view of an aftermarket red wire tapped into the system using a blue splice connector. The lighting is direct and professional, focusing on the technical components against the van's white metal flooring and dark plastic trim. No people are visible in the shot, which serves as a detailed diagnostic view of the vehicle's electrical system.",
    "size_kb": 744,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  },
  {
    "filename": "IMG_0841.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0841.jpg",
    "description": "This high-quality portrait orientation image shows a professional engine bay diagnostic session being performed on a white Mercedes-Benz Sprinter van. A Teslong digital borescope is the central focus, displaying a clear internal inspection image on its screen, while a red Milwaukee impact driver rests on the cowl panel in the background. The lighting is bright and industrial, highlighting professional tools like red battery jumper clamps and various engine components. No people or faces are visible, though a gloved hand is partially seen holding the borescope handle. This scene represents a detailed mechanical inspection within a workshop or professional service setting.",
    "size_kb": 443,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0845.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0845.jpg",
    "description": "This high-quality, portrait-orientation image shows an Owon HDS242 handheld oscilloscope and multimeter being used inside a vehicle cabin, resting on a textured black floor mat. The device is actively measuring 02.685 Volts, with red and black diagnostic test leads plugged into the front and trailing out of frame. The setting appears to be the interior footwell of a Mercedes-Benz Sprinter, evidenced by the \"A210\" part number and Mercedes star logo visible on the plastic trim piece nearby. The lighting is direct and bright, highlighting the diagnostic screen and the dusty, professional working environment of a mobile technician. No people or faces are visible in the shot.",
    "size_kb": 778,
    "width": 1536,
    "height": 2048,
    "orientation": "portrait"
  },
  {
    "filename": "IMG_0855.jpg",
    "original_path": "C:\\Users\\JamiePC\\Desktop\\TriPoint-site\\python-scripts\\converted\\IMG_0855.jpg",
    "description": "This landscape-oriented close-up shows the interior of a vehicle’s dashboard, specifically a Mercedes-Benz electronic control unit (ECU) with a visible part number starting with \"A447,\" indicating it is from a Mercedes-Benz V-Class or Sprinter series. The high-quality image features bright, direct lighting that highlights technical details such as wiring harnesses, electrical connectors, and QR-coded identification labels. No people or diagnostic screens are visible, but the shot focuses on the intricate hardware and wiring typical of a professional diagnostic or repair environment. The mood is functional and technical, documenting the specific hardware components within the van's interior dashboard assembly.",
    "size_kb": 605,
    "width": 2048,
    "height": 1536,
    "orientation": "landscape"
  }
]